{
    "TITLE": "Hallo!",
    "MESSAGE": "Das bin ich, Anastasia Tsypkaykina.",

    "intro.logo": "Ich bin",

    "header.aboutme": "Über mich",
    "header.skills": "Skills",
    "header.portfolio": "Portfolio",
    "header.alt.logo": "Logo von Anastasia Tsypkaykina",
    "header.alt.burger": "Menü",
    "header.alt.close": "Menü schliessen",

    "footer.legalnotice": "Impressum",
    "footer.alt.github": "Github",
    "footer.alt.contact": "Kontakt",
    "footer.alt.linkedin": "LinkedIn",

    "hero.letstalk": "Lass uns sprechen",
    "hero.scrolldown": "Runter scrollen",

    "aboutme.intro1": "Hallo, ich bin Anastasia. Ich bin angehende Frontend-Entwicklerin und lerne derzeit Angular und JavaScript, um moderne und interaktive Webseiten zu gestalten. Dabei fasziniert mich besonders, wie aus Code etwas Neues und Sichtbares entsteht.",
    "aboutme.intro2": "Das Entwickeln gibt mir die Möglichkeit, eigene Ideen umzusetzen und kreative Lösungen zu finden. Es begeistert mich, wenn ich sehe, wie meine Arbeit direkt auf dem Bildschirm lebendig wird.",
    "aboutme.intro3": "Ich bin sehr motiviert, mich ständig weiterzuentwickeln und neue Programmiersprachen zu lernen. Mein Ziel ist es, mein Wissen stetig zu erweitern und in der Praxis anzuwenden.",
    "aboutme.location": "Ich lebe derzeit in Frankfurt, Deutschland, bin aber offen für moderne Arbeitsformen. Remote-Arbeit stellt für mich kein Problem dar - im Gegenteil, sie ermöglicht oft konzentrierteres Arbeiten. Flexibilität gehört für mich zum Berufsbild eines Entwicklers dazu.",
    "aboutme.openminded": "Ich bin eine aufgeschlossene Person, die gerne neue Ideen und Perspektiven kennenlernt und sich ständig weiterentwickeln möchte.",
    "aboutme.problemsolving": "Ich gehe Herausforderungen analytisch und ruhig an, um die bestmögliche Lösung zu finden. Dabei probiere ich verschiedene Ansätze aus, bis ein effektives Ergebnis erreicht ist.",
    
    "skills.myskills": "Kompetenzen",
    "skills.intro1": "Ich verfüge über umfassende Kenntnisse in der Webentwicklung - von der Erstellung statischer Webseiten bis hin zur Umsetzung komplexer, moderner Webanwendungen. Dabei entwickle ich dynamische und responsive Interfaces, die sich flexibel an unterschiedliche Endgeräte anpassen.",
    "skills.intro2": "Ich arbeite routiniert mit REST-APIs und Datenbanken, um interaktive und datengetriebene Anwendungen zu realisieren. Durch die Zusammenarbeit in verschiedenen Projektteams konnte ich meine Fähigkeiten in kollaborativer Entwicklung, Versionskontrolle und strukturiertem Arbeiten kontinuierlich ausbauen.",
    "skills.subheader": "<span class='text-highlight'>Fähigkeit</span> nicht dabei?",
    "skills.subheadertext": "Kontaktiere mich gerne! Mein Ziel ist es, mein Wissen kontinuierlich zu erweitern.",
    "skills.getintouch": "Kontaktieren Sie mich",
    "skills.learnings": "Besonders interessiere ich mich dafür, folgendes zu lernen:",
    "skills.angular": "Angular",
    "skills.api": "REST-API",
    "skills.continuallylearning": "Continually Learning",
    "skills.css": "CSS",
    "skills.firebase": "Firebase",
    "skills.git": "Git",
    "skills.html": "HTML",
    "skills.javascript": "JavaScript",
    "skills.materialdesign": "Material Design",
    "skills.react": "React",
    "skills.scrum": "Scrum",
    "skills.typescript": "TypeScript",
    "skills.vuejs": "Vue.js",
    "skills.wordpress": "WordPress",

    "portfolio.intro": "Hier findest du eine Auswahl meiner Arbeiten - interagiere mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",

    "projects.github": "GitHub",
    "projects.livetest": "Live Test",
    "projects.join": "Join",
    "projects.join.description": "Aufgabenmanager nach dem Vorbild des Kanban-Systems. Erstellst und organisierst Du Aufgaben mit Hilfe von Drag-and-Drop-Funktionen, weise die Benutzer und Kategorien zu.",
    "projects.el_pollo_locco": "El Pollo Loco",
    "projects.el_pollo_locco.description": "Ein einfaches Jump-and-Run-Spiel, das auf einem objektorientierten Ansatz basiert. Hilf José, Münzen und Giftflaschen zu finden, um gegen die Killerhühner zu kämpfen.",
    "projects.pokedex": "Pokédex",
    "projects.pokedex.description": "Eine Webanwendung, die Pokémon-Daten von der PokéAPI abruft. Durchsuche die Pokémon nach Typen, Stufen und Fähigkeiten.",

    "feedback.author_anna": "Kevin Hase",
    "feedback.feedback_anna": "Anastasia überzeugt durch ihre klare Kommunikation, ihre Verlässlichkeit und ihre ruhige, strukturierte Art in jeder Zusammenarbeit.",
    "feedback.author_john": "Tim Daubner",
    "feedback.feedback_john": "Anastasia Tsypkaykina war ein wertvolles und zuverlässiges Mitglied des Teams. Sie erledigte alle ihr übertragenen Aufgaben stets gewissenhaft und verantwortungsbewusst. Durch ihre positive Einstellung und ihre dynamische Art trug sie zu einem ausgewogenen Teamklima bei und zeigte während unserer Zusammenarbeit ausgeprägte Teamfähigkeit.",

    "contact.contact": "Kontakt",
    "contact.title": "Möchtest du ein Problem lösen?",
    "contact.intro": "Dann melde dich bei mir und erzähle, welche Rolle ich übernehmen kann. Mit einem klaren Blick für Nutzerbedürfnisse, strukturierter Umsetzung und einem Gespür für gute Zusammenarbeit bringe ich echten Mehrwert - für dein Team und dein Produkt.",
    "contact.name": "Dein Name",
    "contact.email": "Deine E-Mail-Adresse",
    "contact.message": "Deine Nachricht",
    "contact.privacy": "Ich habe die Datenschutzerklärung gelesen und stimme zu.",
    "contact.send": "Nachricht senden",
    "contact.error.name": "Dein Name ist erforderlich",
    "contact.error.email": "Deine E-Mail-Adresse ist erforderlich",
    "contact.error.message": "Deine Nachricht ist erforderlich",
    "contact.error.privacy": "Bitte stimme den Datenschutzbestimmungen zu",
    "contact.email.sended": "Vielen Dank für deine Nachricht!",
    "contact.email.failed": "Beim Senden der Nachricht ist ein Fehler aufgetreten. Bitte versuche es noch einmal.",
    "contact.back": "Zurück"
}